app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    @post.update(params.require(:post))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "new book for sale! hey"], ["updated_at", "2018-10-24 04:26:50.234936"], ["id", 7]]